const productData = {
    egic: {
        BR: {
            "1/2 قطر": [
                { name: "متر مواسير 1/2", price: 39.5}, { name: "كوع لحام 1/2", price: 15.75},
                { name: "كوع مفتوح لحام 1/2", price: 27 }, { name: "تي لحام 1/2", price: 23},
                { name: "كرنك قصير 1/2", price: 40.5 }, { name: "جلبه لحام 1/2", price: 16 },
                { name: "كوع بسن 1/2* 1/2", price: 109 }, { name: "تي بسن 1/2* 1/2", price: 126.25 },
                { name: "جلبه بسن داخلي 1/2* 1/2", price: 115.5 }, { name: "جلبه بسن خارجي 1/2* 1/2", price: 123},
                { name: "محبس دفن 1/2", price: 560.25 }, { name: "محبس 2 لاكور 1/2 1/2", price: 395.25 }
            ],
            "قطر 3/4 بوصه": [
                { name: "متر مواسير 3/4", price: 66 }, { name: "كوع لحام 3/4", price: 22 },
                { name: "كوع مفتوح لحام 3/4", price: 30.5 }, { name: "تي لحام 3/4", price: 29.75 },
                { name: "كرنك قصير 3/4", price: 50.25 }, { name: "جلبه لحام 3/4", price: 17.75 },
                { name: "كوع بسن 1/2* 3/4", price: 125.75 }, { name: "تي بسن 3/4* 1/2", price: 167 },
                { name: "جلبه بسن داخلي 1/2* 3/4", price: 152 }, { name: "جلبه بسن خارجي 1/2* 3/4", price: 168.75 },
                { name: "محبس دفن 3/4", price: 640.25}, { name: "محبس 2 لاكور 3/4", price: 601.5 }
            ],
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 94.5 }, { name: "كوع لحام 1 بوصه", price: 42},
                { name: "كوع مفتوح لحام 1 بوصه", price:45.5 }, { name: "تي لحام 1 بوصه", price: 53.75 },
                { name: "'طبه كاب 1 بوصه", price: 35.75 }, { name: "جلبه لحام 1 بوصه", price: 30.25 },
                { name: "كوع بسن 1 بوصه", price: 387.5 }, { name: "تي بسن 1 بوصه", price: 446.25 },
                { name: "جلبه بسن داخلي 1 بوصه", price: 346.25 }, { name: "جلبه بسن خارجي 1 بوصه", price: 388.5 },
                { name: "محبس دفن 1 بوصه", price: 822.25 }, { name: "محبس 2 لاكور 1 بوصه", price: 818.75 }
            ],
			
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 227 }, { name: "كوع لحام 1.5 بوصه", price: 154.5 },
                { name: "كوع مفتوح لحام 1.5 بوصه", price: 160.5 }, { name: "تي لحام 1.5 بوصه", price: 169.75 },
                { name: "جلبه لحام 1.5 بوصه", price: 93.5 },
                { name: "طبه كاب 1.5 بوصه", price: 109.5 },
                { name: "جلبه بسن داخلي 1.5 بوصه", price: 691.25 }, { name: "جلبه بسن خارجي 1.5 بوصه", price: 690.25 },
                { name: "محبس 2 لاكور 1.5 بوصه", price: 2033.5 }
            ]
        },
		
		
		
        SMART: {
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 64 }, { name: "كوع عاده 1 بوصه", price: 18.75 },
                { name: "كوع مفتوح 1 بوصه", price: 18.75 }, { name: "تي عاده 1 بوصه", price: 27.5 },
                { name: "تي واي 1 بوصه", price: 31 }, { name: "جلبه لزق 1 بوصه", price: 17.25 },
                { name: "مسلوب 1 بوصه * 1.5", price: 32.5 }, { name: "متر مواسير خفيف 1 بوصه", price: 39.25 }
            ],
			
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 96.5 }, { name: "كوع عاده 1.5 بوصه", price: 28.5 },
                { name: "كوع مفتوح 1.5 بوصه", price: 34.25 }, { name: "تي عاده 1.5 بوصه", price: 46 },
                { name: "تي واي 1.5 بوصه", price: 69 }, { name: "جلبه لزق 1.5 بوصه", price: 28.5 },
                { name: "كوع بسن بانيو 1.5 بوصه", price: 39.25 }, { name: "جلبه بسن 1.5 بانيو 1 بوصه", price: 33 },
                { name: "متر مواسير خفيف 1.5 بوصه", price: 78.75 }
            ],
			
            "قطر 2 بوصه": [
                { name: "متر مواسير 2 بوصه", price: 131.5 }, { name: "كوع عاده 2 بوصه", price: 45.75 },
                { name: "كوع مفتوح 2 بوصه", price: 52.5 }, { name: "تي عاده 2 بوصه", price: 58.5 },
                { name: "تي واي 2 بوصه", price: 86.75 }, { name: "جلبه لزق 2 بوصه", price: 36 },
                { name: "بيبه سمارت 7 سم 2*1.5", price: 159.25 }, { name: "بيبه سمارت 10 سم 2*1.5", price: 226 },
                { name: "مسلوب 2*1.5 بوصه", price: 37.75 }, { name: "متر مواسير خفيف 2 بوصه", price: 109 }
            ],
		
            "قطر 3 بوصه": [
                { name: "متر مواسير 3", price: 171 }, { name: "كوع عاده 3 بوصه", price: 79.75 },
                { name: "كوع مفتوح 3 بوصه", price: 75.5 }, { name: "تي عاده 3 بوصه", price: 134.75 },
                { name: "تي واي 3 بوصه", price: 154.5 }, { name: "تي عاده 3*2", price: 197.75 },
                { name: "تي بباب 3*2", price: 211.25 }, { name: "جلبه 3 بوصه", price: 63.75 },
                { name: "بيبه سمارت 3*1.5", price: 226 }, { name: "بيبه سمارت 10 سم 3*2", price: 226 },
                { name: "متر مواسير خفيف 3 بوصه", price: 145.5 }
            ],
			
            "قطر 4 بوصه": [
                { name: "متر مواسير 4", price: 268.25 }, { name: "كوع عاده 4 بوصه", price: 150.5 },
                { name: "كوع مفتوح 4 بوصه", price: 129 }, { name: "تي عاده 4 بوصه", price: 219.25 },
                { name: "تي واي 4 بوصه", price: 268.5 },
                { name: "تي بباب 4 بوصه", price: 253.25 }, { name: "تي عاده 4*2", price: 297.5 },
                { name: "تي بباب 4*2", price: 305.25 }, { name: "جلبه 4 بوصه", price: 100 },
                { name: "متر مواسير خفيف 4 بوصه", price: 207.75 }
            ],
			
            "عزل ومتنوع المصريه الالمانيه": [
                { name: "جازلة عازل 3 ك", price: 178.25 }, { name: "جازلة عازل 12 ك", price: 492.5 },
                { name: "عازل اسمنتي جركن + شيكاره", price: 751 }, { name: "شحم نباتي 150 مم", price: 106.5 }
            ]
        },
		
		
        KESSEL: {
			
			
            "قطر 32 مم": [
                { name: "متر مواسير 32 مم", price: 57.75 }, { name: "كوع عاده 32 مم", price: 23.5 },
                { name: "كوع مفتوح 32 مم", price: 25.5 }, { name: "تي عاده 32 مم", price: 51 },
                { name: "تي واي 32 مم", price: 53 }, { name: "جلبه لحام 32 مم", price: 30.5 },
                { name: "مسلوب 32*50 مم", price: 35 }, { name: "مسلوب  63*50 مم", price: 50 }
            ],
			
			
            "قطر 50 مم": [
                { name: "متر مواسير 50 مم", price: 73.5 }, { name: "كوع عاده 50 مم", price: 33.75 },
                { name: "كوع مفتوح 50 مم", price: 34.5 }, { name: "تي عاده 50 مم", price: 68.75 },
                { name: "تي واي 50 مم", price: 71 }, { name: "جلبه لحام 50 مم", price: 40.5 },
                { name: "مسلوب 50*75 مم", price: 60.5 }
            ],
			
			
			
            "قطر 63 مم": [
                { name: "متر مواسير 63 مم", price: 90 }, { name: "كوع عاده 63 مم", price: 51.5 },
                { name: "كوع مفتوح 63 مم", price: 84.5 }, { name: "تي عاده  63 مم", price: 82.5 },
                { name: "تي واي 63 مم", price: 85.75 }, { name: "جلبه لحام 63 مم", price: 61 },
                { name: "بيبه 75*63 مم", price: 336 }, { name: "مسلوب 110*50 مم", price: 78.75 }
            ],
			
			
			
			
            "قطر 75 مم": [
                { name: "متر مواسير 75 مم", price: 112}, { name: "كوع عاده 75 مم", price: 67.75 },
                { name: "كوع مفتوح 75 مم", price: 53.25 }, { name: "تي عاده 75 مم", price: 93.25 },
                { name: "تي واي 75 مم", price: 95.5 }, { name: "جلبه لحام 75 مم", price: 79 },
                { name: "بيبه 75*50 مم", price: 294.5 }, { name: "متر مواسير خفيف 75 مم", price: 103.75 },
                { name: "تي بباب 75 مم", price: 149.5 }, { name: "مسلوب 110*75 مم", price: 87 }
            ],
			
			
            "قطر 110 مم": [
                { name: "متر مواسير 110 مم", price: 201.75 }, { name: "كوع عاده 110 مم", price: 83 },
                { name: "كوع مفتوح 110 مم", price: 83.5 }, { name: "تي عاده 110 مم", price: 146 },
                { name: "تي واي 110 مم", price: 147.25 }, { name: "جلبه لحام 110 مم", price: 83.25 },
                { name: "كوع بباب 110 مم", price: 121.25 },
                { name: "صليبه 110 مم", price: 359 }, { name: "تي بباب 110 مم", price: 198.25 }
            ]
			
			
        }
    },
	
	
    belissa: {
THERM: { // بيلسا ثيرم (بولي)
            "1/2 قطر": [
                { name: "متر مواسير 1/2", price: 24.5 }, { name: "كوع لحام 1/2", price: 4.7 },
                { name: "طبة اختبار 1/2", price: 4 }, { name: "تي لحام 1/2", price: 7 },
                { name: "كرنك قصير 1/2", price: 9.5 }, { name: "جلبه لحام 1/2", price: 3 },
                { name: "كوع بسن 1/2* 1/2", price: 33 }, { name: "تي بسن 1/2* 1/2", price: 30.5 },
                { name: "جلبه بسن داخلي 1/2* 1/2", price: 26.5 }, { name: "جلبه بسن خارجي 1/2* 1/2", price: 40 },
                { name: "محبس دفن 1/2", price: 316.5 }, { name: "محبس دفن مشروعات 1/2 1/2", price: 270 }
            ],
            "قطر 3/4 بوصه": [
                { name: "متر مواسير 3/4", price: 36.5 }, { name: "كوع لحام 3/4", price: 7.4 },
                { name: "كوع مفتوح لحام 3/4", price: 9 }, { name: "تي لحام 3/4", price: 12.5 },
                { name: "كرنك قصير 3/4", price: 14 }, { name: "جلبه لحام 3/4", price: 4.75 },
                { name: "كوع بسن 1/2* 3/4", price: 34 }, { name: "تي بسن 1/2* 1/2", price: 34 },
                { name: "جلبه بسن داخلي 1/2* 3/4", price: 30.5 }, { name: "جلبه بسن خارجي 1/2* 3/4", price: 46 },
                { name: "محبس دفن 3/4", price: 350 }, { name: "محبس دفن مشروعات 3/4", price: 300 }
            ],
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 60.5 }, { name: "كوع لحام 1 بوصه", price: 12 },
                { name: "كوع مفتوح لحام 1 بوصه", price: 15 }, { name: "تي لحام 1 بوصه", price: 12.75 },
                { name: "محبس 2 لاكور 1 بوصه", price: 535 }, { name: "جلبه لحام 1 بوصه", price: 10.5 },
                { name: "متر 1 بوصه بي ان 16", price: 53 }, { name: "طبه كاب 1 بوصه", price: 9 },
                { name: "جلبه بسن داخلي 1 بوصه", price: 65 }, { name: "جلبه بسن خارجي 1 بوصه", price: 95 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 158.5 }, { name: "كوع لحام 1.5 بوصه", price: 30 },
                { name: "تي لحام 1.5 بوصه", price: 51 }, { name: "جلبه لحام 1.5 بوصه", price: 23.5 },
                { name: "جلبه بسن داخلي 1.5 بوصه", price: 165 }, { name: "جلبه بسن خارجي 1.5 بوصه", price: 195 },
                { name: "مسلوب 1*1.5 بوصه", price: 34.5 }, { name: "طبه كاب 1.5 بوصه", price: 30 }
            ]
        }
    },
	
	
    pilsa_white: {
WHITE: { // بيلسا وايت (صرف أبيض)
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 26.5 }, { name: "كوع عاده 1 بوصه", price: 14.5 },
                { name: "كوع مفتوح 1 بوصه", price: 13.5 }, { name: "تي عاده 1 بوصه", price: 16.75 },
                { name: "تي واي 1 بوصه", price: 20 }, { name: "جلبه لزق 1 بوصه", price: 8.5 },
                { name: "مسلوب 1 بوصه * 1.5", price: 13.5 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 62.25 }, { name: "كوع عاده 1.5 بوصه", price: 21.5 },
                { name: "كوع مفتوح 1.5 بوصه", price: 17 }, { name: "تي عاده 1.5 بوصه", price: 26.25 },
                { name: "تي واي 1.5 بوصه", price: 30.5 }, { name: "جلبه لزق 1.5 بوصه", price: 12.5 }
            ],
            "قطر 2 بوصه": [
                { name: "متر مواسير 2 بوصه", price: 78.25 }, { name: "كوع عاده 2 بوصه", price: 31.5 },
                { name: "كوع مفتوح 2 بوصه", price: 22.25 }, { name: "تي عاده 2 بوصه", price: 38.25 },
                { name: "تي واي 2 بوصه", price: 52 }, { name: "تي بباب 2 بوصه", price: 56 },
                { name: "بيبه  7 سم 2*1.5", price: 100 }, { name: "بيبه  10 سم 2*1.5", price: 110 }
            ],
            "قطر 3 بوصه": [
                { name: "متر مواسير 3", price: 112.5 }, { name: "كوع عاده 3 بوصه", price: 45 },
                { name: "كوع مفتوح 3 بوصه", price: 42 }, { name: "تي عاده 3 بوصه", price: 62.5 },
                { name: "تي واي 3 بوصه", price: 72.5 }, { name: "تي عاده 3*2", price: 63.5 },
                { name: "تي بباب 3*2", price: 91.5 }, { name: "جلبه 3 بوصه", price: 31 }
            ],
            "قطر 4 بوصه": [
                { name: "متر مواسير 4", price: 144 }, { name: "كوع عاده 4 بوصه", price: 91.5 },
                { name: "كوع مفتوح 4 بوصه", price: 71 }, { name: "تي عاده 4 بوصه", price: 160 },
                { name: "تي واي 4 بوصه", price: 165 }, { name: "تي عاده 4*2", price: 121 },
                { name: "تي بباب4 *2", price: 145.5 }, { name: "جلبه 4 بوصه", price: 59 }
            ]
        }
    },
    aqua_nil: {
GAWAN: { // أكوا نيل (صرف بجوان)
            "قطر 32 مم": [
                { name: "متر مواسير 32 مم", price: 38 }, { name: "كوع عاده 32 مم", price: 16 },
                { name: "كوع مفتوح 32 مم", price: 15 }, { name: "تي عاده 32 مم", price: 22.75 },
                { name: "تي واي 32 مم", price: 28 }, { name: "جلبه لحام 32 مم", price: 17 },
                { name: "مسلوب 32*50 مم", price: 27.25 }, { name: "طبه كاب 32 مم", price: 10.25 }
            ],
            "قطر 50 مم": [
                { name: "متر مواسير 50 مم", price: 51 }, { name: "كوع عاده 50 مم", price: 21.5 },
                { name: "كوع مفتوح 50 مم", price: 18.65 }, { name: "تي عاده 50 مم", price: 33.75 },
                { name: "تي واي 50 مم", price: 36.5 }, { name: "جلبه لحام 50 مم", price: 23.5 },
                { name: "جلبة اصلاح 50 مم", price: 37.25 }
            ],
            "قطر 63 مم": [
                { name: "متر مواسير 63 مم", price: 64 }, { name: "كوع عاده 63 مم", price: 28 },
                { name: "كوع مفتوح 63 مم", price: 25.5 }, { name: "تي عاده 63 مم", price: 46.5 },
                { name: "تي واي 63 مم", price: 52.5 }, { name: "جلبه لحام 63 مم", price: 26.75 },
                { name: "بيبه 75*63 مم", price: 269.5 }, { name: "جلبة اصلاح 63 مم", price: 57.5 }
            ],
            "قطر 75 مم": [
                { name: "متر مواسير 75 مم", price: 80 }, { name: "كوع عاده 75 مم", price: 40 },
                { name: "كوع مفتوح 75 مم", price: 32.75 }, { name: "تي عاده 75 مم", price: 56.5 },
                { name: "تي واي 75 مم", price: 64.5 }, { name: "جلبه لحام 75 مم", price: 37.5 },
                { name: "بيبه 75*63 مم", price: 239.4 }, { name: "بيبه كيسيل 36* 63 مم", price: 237 }
            ],
            "قطر 110 مم": [
                { name: "متر مواسير 110 مم", price: 153.5 }, { name: "كوع عاده 110 مم", price: 67.5 },
                { name: "كوع مفتوح 110 مم", price: 61.5 }, { name: "تي عاده 110 مم", price: 125.9 },
                { name: "تي واي 110 مم", price: 123.7 }, { name: "جلبه لحام 110 مم", price: 69.75 }
            ]
        }
    }
};
