const productData = {
    egic: {
        BR: {
            "1/2 قطر": [
                { name: "متر مواسير 1/2", price: 35.5 }, { name: "كوع لحام 1/2", price: 14.25 },
                { name: "كوع مفتوح لحام 1/2", price: 24.25 }, { name: "تي لحام 1/2", price: 20.75 },
                { name: "كرنك قصير 1/2", price: 36.5 }, { name: "جلبه لحام 1/2", price: 14.5 },
                { name: "كوع بسن 1/2* 1/2", price: 98.25 }, { name: "تي بسن 1/2* 1/2", price: 113.75 },
                { name: "جلبه بسن داخلي 1/2* 1/2", price: 104 }, { name: "جلبه بسن خارجي 1/2* 1/2", price: 110.75 },
                { name: "محبس دفن 1/2", price: 560.25 }, { name: "محبس 2 لاكور 1/2 1/2", price: 395.25 }
            ],
            "قطر 3/4 بوصه": [
                { name: "متر مواسير 3/4", price: 59.5 }, { name: "كوع لحام 3/4", price: 19.75 },
                { name: "كوع مفتوح لحام 3/4", price: 27.5 }, { name: "تي لحام 3/4", price: 26.75 },
                { name: "كرنك قصير 3/4", price: 45.25 }, { name: "جلبه لحام 3/4", price: 16 },
                { name: "كوع بسن 1/2* 3/4", price: 113.25 }, { name: "تي بسن 3/4* 1/2", price: 150.5 },
                { name: "جلبه بسن داخلي 1/2* 3/4", price: 137 }, { name: "جلبه بسن خارجي 1/2* 3/4", price: 152 },
                { name: "محبس دفن 3/4", price: 576.75 }, { name: "محبس 2 لاكور 3/4", price: 542 }
            ],
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 85.25 }, { name: "كوع لحام 1 بوصه", price: 37.75 },
                { name: "كوع مفتوح لحام 1 بوصه", price: 41 }, { name: "تي لحام 1 بوصه", price: 48.5 },
                { name: "'طبه كاب 1 بوصه", price: 32.25 }, { name: "جلبه لحام 1 بوصه", price: 27.25 },
                { name: "كوع بسن 1 بوصه", price: 349 }, { name: "تي بسن 1 بوصه", price: 402 },
                { name: "جلبه بسن داخلي 1 بوصه", price: 312 }, { name: "جلبه بسن خارجي 1 بوصه", price: 350 },
                { name: "محبس دفن 1 بوصه", price: 740.75 }, { name: "محبس 2 لاكور 1 بوصه", price: 737.5 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 204.5 }, { name: "كوع لحام 1.5 بوصه", price: 139.25 },
                { name: "كوع مفتوح لحام 1.5 بوصه", price: 144.5 }, { name: "تي لحام 1.5 بوصه", price: 153 },
                { name: "جلبه لحام 1.5 بوصه", price: 84 },
                { name: "طبه كاب 1.5 بوصه", price: 98.75 },
                { name: "جلبه بسن داخلي 1.5 بوصه", price: 622.75 }, { name: "جلبه بسن خارجي 1.5 بوصه", price: 622.25 },
                { name: "محبس 2 لاكور 1.5 بوصه", price: 1831.75 }
            ]
        },
        SMART: {
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 57.75 }, { name: "كوع عاده 1 بوصه", price: 17 },
                { name: "كوع مفتوح 1 بوصه", price: 17 }, { name: "تي عاده 1 بوصه", price: 25 },
                { name: "تي واي 1 بوصه", price: 28 }, { name: "جلبه لزق 1 بوصه", price: 15.5 },
                { name: "مسلوب 1 بوصه * 1.5", price: 29.25 }, { name: "متر مواسير خفيف 1 بوصه", price: 35.25 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 87 }, { name: "كوع عاده 1.5 بوصه", price: 25.75 },
                { name: "كوع مفتوح 1.5 بوصه", price: 30.75 }, { name: "تي عاده 1.5 بوصه", price: 41.5 },
                { name: "تي واي 1.5 بوصه", price: 62.25 }, { name: "جلبه لزق 1.5 بوصه", price: 25.75 },
                { name: "كوع بسن بانيو 1.5 بوصه", price: 35.25 }, { name: "جلبه بسن 1.5 بانيو 1 بوصه", price: 29.75 },
                { name: "متر مواسير خفيف 1.5 بوصه", price: 71 }
            ],
            "قطر 2 بوصه": [
                { name: "متر مواسير 2 بوصه", price: 118.5 }, { name: "كوع عاده 2 بوصه", price: 41.25 },
                { name: "كوع مفتوح 2 بوصه", price: 46.25 }, { name: "تي عاده 2 بوصه", price: 52.75 },
                { name: "تي واي 2 بوصه", price: 78.25 }, { name: "جلبه لزق 2 بوصه", price: 32.5 },
                { name: "بيبه سمارت 7 سم 2*1.5", price: 143.5 }, { name: "بيبه سمارت 10 سم 2*1.5", price: 203.5 },
                { name: "مسلوب 2*1.5 بوصه", price: 34 }, { name: "متر مواسير خفيف 2 بوصه", price: 98.25 }
            ],
            "قطر 3 بوصه": [
                { name: "متر مواسير 3", price: 193 }, { name: "كوع عاده 3 بوصه", price: 71.75 },
                { name: "كوع مفتوح 3 بوصه", price: 68 }, { name: "تي عاده 3 بوصه", price: 121 },
                { name: "تي واي 3 بوصه", price: 139.25 }, { name: "تي عاده 3*2", price: 158.75 },
                { name: "تي بباب 3*2", price: 169.5 }, { name: "جلبه 3 بوصه", price: 57.5 },
                { name: "بيبه سمارت 3*1.5", price: 203.5 }, { name: "بيبه سمارت 10 سم 3*2", price: 203.5 },
                { name: "متر مواسير خفيف 3 بوصه", price: 154 }
            ],
            "قطر 4 بوصه": [
                { name: "متر مواسير 4", price: 241.75 }, { name: "كوع عاده 4 بوصه", price: 135.5 },
                { name: "كوع مفتوح 4 بوصه", price: 116.25 }, { name: "تي عاده 4 بوصه", price: 197.5 },
                { name: "تي واي 4 بوصه", price: 242 }, { name: "تي عاده 4*2", price: 158.75 },
                { name: "تي بباب 4*2", price: 169.5 }, { name: "جلبه 4 بوصه", price: 90 },
                { name: "متر مواسير خفيف 4 بوصه", price: 187.25 }
            ],
            "عزل ومتنوع المصريه الالمانيه": [
                { name: "جازلة عازل 3 ك", price: 160.5 }, { name: "جازلة عازل 12 ك", price: 443.75 },
                { name: "عازل اسمنتي جركن + شيكاره", price: 676.5 }, { name: "شحم نباتي 150 مم", price: 96 }
            ]
        },
        KESSEL: {
            "قطر 32 مم": [
                { name: "متر مواسير 32 مم", price: 52 }, { name: "كوع عاده 32 مم", price: 23 },
                { name: "كوع مفتوح 32 مم", price: 21.25 }, { name: "تي عاده 32 مم", price: 46 },
                { name: "تي واي 32 مم", price: 47.75 }, { name: "جلبه لحام 32 مم", price: 27.5 },
                { name: "مسلوب 32*50 مم", price: 30.5 }, { name: "مسلوب  63*50 مم", price: 46.5 }
            ],
            "قطر 50 مم": [
                { name: "متر مواسير 50 مم", price: 66.25 }, { name: "كوع عاده 50 مم", price: 30 },
                { name: "كوع مفتوح 50 مم", price: 31 }, { name: "تي عاده 50 مم", price: 62 },
                { name: "تي واي 50 مم", price: 64 }, { name: "جلبه لحام 50 مم", price: 36.5 },
                { name: "مسلوب 50*75 مم", price: 54.5 }
            ],
            "قطر 63 مم": [
                { name: "متر مواسير 63 مم", price: 79.75 }, { name: "كوع عاده 63 مم", price: 46.5 },
                { name: "كوع مفتوح 63 مم", price: 43.5 }, { name: "تي عاده  63 مم", price: 74.25 },
                { name: "تي واي 63 مم", price: 77.25 }, { name: "جلبه لحام 63 مم", price: 55 },
                { name: "بيبه 75*63 مم", price: 302.75 }, { name: "مسلوب 110*50 مم", price: 71 }
            ],
            "قطر 75 مم": [
                { name: "متر مواسير 75 مم", price: 93.5 }, { name: "كوع عاده 75 مم", price: 61 },
                { name: "كوع مفتوح 75 مم", price: 48 }, { name: "تي عاده 75 مم", price: 84 },
                { name: "تي واي 75 مم", price: 86 }, { name: "جلبه لحام 75 مم", price: 61 },
                { name: "بيبه 75*50 مم", price: 265.25 }, { name: "متر مواسير خفيف 63 مم", price: 83.25 },
                { name: "تي بباب 75 مم", price: 134.75 }, { name: "مسلوب 110*75 مم", price: 80.75 }
            ],
            "قطر 110 مم": [
                { name: "متر مواسير 110 مم", price: 181.75 }, { name: "كوع عاده 110 مم", price: 74.75 },
                { name: "كوع مفتوح 110 مم", price: 75.25 }, { name: "تي عاده 110 مم", price: 131.5 },
                { name: "تي واي 110 مم", price: 132.75 }, { name: "جلبه لحام 110 مم", price: 75 },
                { name: "كوع بسن baniu 50مم", price: 30.5 },
                { name: "صليبه 110 مم", price: 323.5 }, { name: "مشترك بباب 110 مم", price: 178.5 }
            ]
        }
    },
	
	
    belissa: {
THERM: { // بيلسا ثيرم (بولي)
            "1/2 قطر": [
                { name: "متر مواسير 1/2", price: 24.5 }, { name: "كوع لحام 1/2", price: 4.7 },
                { name: "طبة اختبار 1/2", price: 4 }, { name: "تي لحام 1/2", price: 7 },
                { name: "كرنك قصير 1/2", price: 9.5 }, { name: "جلبه لحام 1/2", price: 3 },
                { name: "كوع بسن 1/2* 1/2", price: 33 }, { name: "تي بسن 1/2* 1/2", price: 30.5 },
                { name: "جلبه بسن داخلي 1/2* 1/2", price: 26.5 }, { name: "جلبه بسن خارجي 1/2* 1/2", price: 40 },
                { name: "محبس دفن 1/2", price: 316.5 }, { name: "محبس دفن مشروعات 1/2 1/2", price: 270 }
            ],
            "قطر 3/4 بوصه": [
                { name: "متر مواسير 3/4", price: 36.5 }, { name: "كوع لحام 3/4", price: 7.4 },
                { name: "كوع مفتوح لحام 3/4", price: 9 }, { name: "تي لحام 3/4", price: 12.5 },
                { name: "كرنك قصير 3/4", price: 14 }, { name: "جلبه لحام 3/4", price: 4.75 },
                { name: "كوع بسن 1/2* 3/4", price: 34 }, { name: "تي بسن 1/2* 1/2", price: 34 },
                { name: "جلبه بسن داخلي 1/2* 3/4", price: 30.5 }, { name: "جلبه بسن خارجي 1/2* 3/4", price: 46 },
                { name: "محبس دفن 3/4", price: 350 }, { name: "محبس دفن مشروعات 3/4", price: 300 }
            ],
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 60.5 }, { name: "كوع لحام 1 بوصه", price: 12 },
                { name: "كوع مفتوح لحام 1 بوصه", price: 15 }, { name: "تي لحام 1 بوصه", price: 12.75 },
                { name: "محبس 2 لاكور 1 بوصه", price: 535 }, { name: "جلبه لحام 1 بوصه", price: 10.5 },
                { name: "متر 1 بوصه بي ان 16", price: 53 }, { name: "طبه كاب 1 بوصه", price: 9 },
                { name: "جلبه بسن داخلي 1 بوصه", price: 65 }, { name: "جلبه بسن خارجي 1 بوصه", price: 95 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 158.5 }, { name: "كوع لحام 1.5 بوصه", price: 30 },
                { name: "تي لحام 1.5 بوصه", price: 51 }, { name: "جلبه لحام 1.5 بوصه", price: 23.5 },
                { name: "جلبه بسن داخلي 1.5 بوصه", price: 165 }, { name: "جلبه بسن خارجي 1.5 بوصه", price: 195 },
                { name: "مسلوب 1*1.5 بوصه", price: 34.5 }, { name: "طبه كاب 1.5 بوصه", price: 30 }
            ]
        }
    },
	
	
    pilsa_white: {
WHITE: { // بيلسا وايت (صرف أبيض)
            "قطر 1 بوصه": [
                { name: "متر مواسير 1 بوصه", price: 26.5 }, { name: "كوع عاده 1 بوصه", price: 14.5 },
                { name: "كوع مفتوح 1 بوصه", price: 13.5 }, { name: "تي عاده 1 بوصه", price: 16.75 },
                { name: "تي واي 1 بوصه", price: 20 }, { name: "جلبه لزق 1 بوصه", price: 8.5 },
                { name: "مسلوب 1 بوصه * 1.5", price: 13.5 }
            ],
            "قطر 1.5 بوصه": [
                { name: "متر مواسير 1.5 بوصه", price: 62.25 }, { name: "كوع عاده 1.5 بوصه", price: 21.5 },
                { name: "كوع مفتوح 1.5 بوصه", price: 17 }, { name: "تي عاده 1.5 بوصه", price: 26.25 },
                { name: "تي واي 1.5 بوصه", price: 30.5 }, { name: "جلبه لزق 1.5 بوصه", price: 12.5 }
            ],
            "قطر 2 بوصه": [
                { name: "متر مواسير 2 بوصه", price: 78.25 }, { name: "كوع عاده 2 بوصه", price: 31.5 },
                { name: "كوع مفتوح 2 بوصه", price: 22.25 }, { name: "تي عاده 2 بوصه", price: 38.25 },
                { name: "تي واي 2 بوصه", price: 52 }, { name: "تي بباب 2 بوصه", price: 56 },
                { name: "بيبه  7 سم 2*1.5", price: 100 }, { name: "بيبه  10 سم 2*1.5", price: 110 }
            ],
            "قطر 3 بوصه": [
                { name: "متر مواسير 3", price: 112.5 }, { name: "كوع عاده 3 بوصه", price: 45 },
                { name: "كوع مفتوح 3 بوصه", price: 42 }, { name: "تي عاده 3 بوصه", price: 62.5 },
                { name: "تي واي 3 بوصه", price: 72.5 }, { name: "تي عاده 3*2", price: 63.5 },
                { name: "تي بباب 3*2", price: 91.5 }, { name: "جلبه 3 بوصه", price: 31 }
            ],
            "قطر 4 بوصه": [
                { name: "متر مواسير 4", price: 144 }, { name: "كوع عاده 4 بوصه", price: 91.5 },
                { name: "كوع مفتوح 4 بوصه", price: 71 }, { name: "تي عاده 4 بوصه", price: 160 },
                { name: "تي واي 4 بوصه", price: 165 }, { name: "تي عاده 4*2", price: 121 },
                { name: "تي بباب4 *2", price: 145.5 }, { name: "جلبه 4 بوصه", price: 59 }
            ]
        }
    },
    aqua_nil: {
GAWAN: { // أكوا نيل (صرف بجوان)
            "قطر 32 مم": [
                { name: "متر مواسير 32 مم", price: 38 }, { name: "كوع عاده 32 مم", price: 16 },
                { name: "كوع مفتوح 32 مم", price: 15 }, { name: "تي عاده 32 مم", price: 22.75 },
                { name: "تي واي 32 مم", price: 28 }, { name: "جلبه لحام 32 مم", price: 17 },
                { name: "مسلوب 32*50 مم", price: 27.25 }, { name: "طبه كاب 32 مم", price: 10.25 }
            ],
            "قطر 50 مم": [
                { name: "متر مواسير 50 مم", price: 51 }, { name: "كوع عاده 50 مم", price: 21.5 },
                { name: "كوع مفتوح 50 مم", price: 18.65 }, { name: "تي عاده 50 مم", price: 33.75 },
                { name: "تي واي 50 مم", price: 36.5 }, { name: "جلبه لحام 50 مم", price: 23.5 },
                { name: "جلبة اصلاح 50 مم", price: 37.25 }
            ],
            "قطر 63 مم": [
                { name: "متر مواسير 63 مم", price: 64 }, { name: "كوع عاده 63 مم", price: 28 },
                { name: "كوع مفتوح 63 مم", price: 25.5 }, { name: "تي عاده 63 مم", price: 46.5 },
                { name: "تي واي 63 مم", price: 52.5 }, { name: "جلبه لحام 63 مم", price: 26.75 },
                { name: "بيبه 75*63 مم", price: 269.5 }, { name: "جلبة اصلاح 63 مم", price: 57.5 }
            ],
            "قطر 75 مم": [
                { name: "متر مواسير 75 مم", price: 80 }, { name: "كوع عاده 75 مم", price: 40 },
                { name: "كوع مفتوح 75 مم", price: 32.75 }, { name: "تي عاده 75 مم", price: 56.5 },
                { name: "تي واي 75 مم", price: 64.5 }, { name: "جلبه لحام 75 مم", price: 37.5 },
                { name: "بيبه 75*63 مم", price: 239.4 }, { name: "بيبه كيسيل 36* 63 مم", price: 237 }
            ],
            "قطر 110 مم": [
                { name: "متر مواسير 110 مم", price: 153.5 }, { name: "كوع عاده 110 مم", price: 67.5 },
                { name: "كوع مفتوح 110 مم", price: 61.5 }, { name: "تي عاده 110 مم", price: 125.9 },
                { name: "تي واي 110 مم", price: 123.7 }, { name: "جلبه لحام 110 مم", price: 69.75 }
            ]
        }
    }
};